In [1]:
import pandas as pd
import numpy as np

In [2]:
data = [12,24,48,56]
data

[12, 24, 48, 56]

In [3]:
array = np.array([2,3,4,5])
array

array([2, 3, 4, 5])

In [4]:
pd.Series(data)

0    12
1    24
2    48
3    56
dtype: int64

In [5]:
pd.Series(array)

0    2
1    3
2    4
3    5
dtype: int64

In [6]:
labels = ['a','b','c','d']
labels

['a', 'b', 'c', 'd']

In [7]:
pd.Series(data,labels)

a    12
b    24
c    48
d    56
dtype: int64

In [8]:
pd.Series(data=labels)

0    a
1    b
2    c
3    d
dtype: object

In [9]:
ser1 = pd.Series(data, labels)
ser1

a    12
b    24
c    48
d    56
dtype: int64

In [10]:
dict1 = { 'a': 5, 'b': 8, 'c':13, 'd':19, 'e':22}
dict1

{'a': 5, 'b': 8, 'c': 13, 'd': 19, 'e': 22}

In [11]:
ser2 = pd.Series(dict1)
ser2

a     5
b     8
c    13
d    19
e    22
dtype: int64

In [12]:
ser1 + ser2

a    17.0
b    32.0
c    61.0
d    75.0
e     NaN
dtype: float64

In [13]:
ser1['a':'c']

a    12
b    24
c    48
dtype: int64

In [14]:
ser1[0:2]

a    12
b    24
dtype: int64

In [15]:
df = pd.DataFrame(np.random.randn(4,5))
df

          0         1         2         3         4
0 -0.216304  0.104170 -0.662146 -0.216407 -1.601826
1 -0.419744  0.525996  1.298229  1.750784 -0.719004
2  0.492967  1.329725 -0.298283 -1.545720 -0.703321
3 -0.618539 -2.315802  0.375677  1.083744  0.972135

In [16]:
df = pd.DataFrame(np.random.randn(4,5), ['USD', 'CAD', 'GBP', 'EUR'],['A','B','C', 'D', 'E'])
df

            A         B         C         D         E
USD -0.395207  0.339582  0.349910 -0.981842 -1.541593
CAD -0.120731 -1.005801 -0.013466 -0.028346  0.140591
GBP -0.064888  0.898320 -0.191393 -0.278510  1.424230
EUR -2.072917  0.379925  1.236930 -0.121124 -1.314774

In [17]:
df['A']

USD   -0.395207
CAD   -0.120731
GBP   -0.064888
EUR   -2.072917
Name: A, dtype: float64

In [18]:
df[['A','C']]

            A         C
USD -0.395207  0.349910
CAD -0.120731 -0.013466
GBP -0.064888 -0.191393
EUR -2.072917  1.236930

In [19]:
df['USD':'GBP']

            A         B         C         D         E
USD -0.395207  0.339582  0.349910 -0.981842 -1.541593
CAD -0.120731 -1.005801 -0.013466 -0.028346  0.140591
GBP -0.064888  0.898320 -0.191393 -0.278510  1.424230

In [20]:
df[0:2]

            A         B         C         D         E
USD -0.395207  0.339582  0.349910 -0.981842 -1.541593
CAD -0.120731 -1.005801 -0.013466 -0.028346  0.140591

In [21]:
df.loc['USD':'GBP']

            A         B         C         D         E
USD -0.395207  0.339582  0.349910 -0.981842 -1.541593
CAD -0.120731 -1.005801 -0.013466 -0.028346  0.140591
GBP -0.064888  0.898320 -0.191393 -0.278510  1.424230

In [23]:
df_csv = pd.read_csv('pandas-create-dataframes.csv')
df_csv

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C